FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NXP_LPC55S69_MCUXpresso/NXP_Code/drivers/fsl_common_arm.h
/*
 * Copyright (c) 2015-2016, Freescale Semiconductor, Inc.
 * Copyright 2016-2022 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#ifndef _FSL_COMMON_ARM_H_
    #define _FSL_COMMON_ARM_H_

/*
 * For CMSIS pack RTE.
 * CMSIS pack RTE generates "RTC_Components.h" which contains the statements
 * of the related <RTE_Components_h> element for all selected software components.
 */
    #ifdef _RTE_
        #include "RTE_Components.h"
    #endif

/*!
 * @addtogroup ksdk_common
 * @{
 */

/*! @name Atomic modification
 *
 * These macros are used for atomic access, such as read-modify-write
 * to the peripheral registers.
 *
 * - SDK_ATOMIC_LOCAL_ADD
 * - SDK_ATOMIC_LOCAL_SET
 * - SDK_ATOMIC_LOCAL_CLEAR
 * - SDK_ATOMIC_LOCAL_TOGGLE
 * - SDK_ATOMIC_LOCAL_CLEAR_AND_SET
 *
 * Take SDK_ATOMIC_LOCAL_CLEAR_AND_SET as an example: the parameter @c addr
 * means the address of the peripheral register or variable you want to modify
 * atomically, the parameter @c clearBits is the bits to clear, the parameter
 * @c setBits it the bits to set.
 * For example, to set a 32-bit register bit1:bit0 to 0b10, use like this:
 *
 * @code
 * volatile uint32_t * reg = (volatile uint32_t *)REG_ADDR;
 *
 * SDK_ATOMIC_LOCAL_CLEAR_AND_SET(reg, 0x03, 0x02);
 * @endcode
 *
 * In this example, the register bit1:bit0 are cleared and bit1 is set, as a result,
 * register bit1:bit0 = 0b10.
 *
 * @note For the platforms don't support exclusive load and store, these macros
 * disable the global interrupt to pretect the modification.
 *
 * @note These macros only guarantee the local processor atomic operations. For
 * the multi-processor devices, use hardware semaphore such as SEMA42 to
 * guarantee exclusive access if necessary.
 *
 * @{
 */

/* clang-format off */
    #if ( ( defined( __ARM_ARCH_7M__ ) && ( __ARM_ARCH_7M__ == 1 ) ) ||     \
    ( defined( __ARM_ARCH_7EM__ ) && ( __ARM_ARCH_7EM__ == 1 ) ) ||         \
    ( defined( __ARM_ARCH_8M_MAIN__ ) && ( __ARM_ARCH_8M_MAIN__ == 1 ) ) || \
    ( defined( __ARM_ARCH_8M_BASE__ ) && ( __ARM_ARCH_8M_BASE__ == 1 ) ) )
/* clang-format on */

/* If the LDREX and STREX are supported, use them. */
        #define _SDK_ATOMIC_LOCAL_OPS_1BYTE( addr, val, ops ) \
    do                                                        \
    {                                                         \
        ( val ) = __LDREXB( addr );                           \
        ( ops );                                              \
    } while( 0UL != __STREXB( ( val ), ( addr ) ) )

        #define _SDK_ATOMIC_LOCAL_OPS_2BYTE( addr, val, ops ) \
    do                                                        \
    {                                                         \
        ( val ) = __LDREXH( addr );                           \
        ( ops );                                              \
    } while( 0UL != __STREXH( ( val ), ( addr ) ) )

        #define _SDK_ATOMIC_LOCAL_OPS_4BYTE( addr, val, ops ) \
    do                                                        \
    {                                                         \
        ( val ) = __LDREXW( addr );                           \
        ( ops );                                              \
    } while( 0UL != __STREXW( ( val ), ( addr ) ) )

        static inline void _SDK_AtomicLocalAdd1Byte( volatile uint8_t * addr,
                                                     uint8_t val )
        {
            uint8_t s_val;

            _SDK_ATOMIC_LOCAL_OPS_1BYTE( addr, s_val, s_val += val );
        }

        static inline void _SDK_AtomicLocalAdd2Byte( volatile uint16_t * addr,
                                                     uint16_t val )
        {
            uint16_t s_val;

            _SDK_ATOMIC_LOCAL_OPS_2BYTE( addr, s_val, s_val += val );
        }

        static inline void _SDK_AtomicLocalAdd4Byte( volatile uint32_t * addr,
                                                     uint32_t val )
        {
            uint32_t s_val;

            _SDK_ATOMIC_LOCAL_OPS_4BYTE( addr, s_val, s_val += val );
        }

        static inline void _SDK_AtomicLocalSub1Byte( volatile uint8_t * addr,
                                                     uint8_t val )
        {
            uint8_t s_val;

            _SDK_ATOMIC_LOCAL_OPS_1BYTE( addr, s_val, s_val -= val );
        }

        static inline void _SDK_AtomicLocalSub2Byte( volatile uint16_t * addr,
                                                     uint16_t val )
        {
            uint16_t s_val;

            _SDK_ATOMIC_LOCAL_OPS_2BYTE( addr, s_val, s_val -= val );
        }

        static inline void _SDK_AtomicLocalSub4Byte( volatile uint32_t * addr,
                                                     uint32_t val )
        {
            uint32_t s_val;

            _SDK_ATOMIC_LOCAL_OPS_4BYTE( addr, s_val, s_val -= val );
        }

        static inline void _SDK_AtomicLocalSet1Byte( volatile uint8_t * addr,
                                                     uint8_t bits )
        {
            uint8_t s_val;

            _SDK_ATOMIC_LOCAL_OPS_1BYTE( addr, s_val, s_val |= bits );
        }

        static inline void _SDK_AtomicLocalSet2Byte( volatile uint16_t * addr,
                                                     uint16_t bits )
        {
            uint16_t s_val;

            _SDK_ATOMIC_LOCAL_OPS_2BYTE( addr, s_val, s_val |= bits );
        }

        static inline void _SDK_AtomicLocalSet4Byte( volatile uint32_t * addr,
                                                     uint32_t bits )
        {
            uint32_t s_val;

            _SDK_ATOMIC_LOCAL_OPS_4BYTE( addr, s_val, s_val |= bits );
        }

        static inline void _SDK_AtomicLocalClear1Byte( volatile uint8_t * addr,
                                                       uint8_t bits )
        {
            uint8_t s_val;

            _SDK_ATOMIC_LOCAL_OPS_1BYTE( addr, s_val, s_val &= ~bits );
        }

        static inline void _SDK_AtomicLocalClear2Byte( volatile uint16_t * addr,
                                                       uint16_t bits )
        {
            uint16_t s_val;

