FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NXP_LPC55S69_MCUXpresso/NXP_Code/drivers/fsl_common_arm.h
            _SDK_ATOMIC_LOCAL_OPS_2BYTE( addr, s_val, s_val &= ~bits );
        }

        static inline void _SDK_AtomicLocalClear4Byte( volatile uint32_t * addr,
                                                       uint32_t bits )
        {
            uint32_t s_val;

            _SDK_ATOMIC_LOCAL_OPS_4BYTE( addr, s_val, s_val &= ~bits );
        }

        static inline void _SDK_AtomicLocalToggle1Byte( volatile uint8_t * addr,
                                                        uint8_t bits )
        {
            uint8_t s_val;

            _SDK_ATOMIC_LOCAL_OPS_1BYTE( addr, s_val, s_val ^= bits );
        }

        static inline void _SDK_AtomicLocalToggle2Byte( volatile uint16_t * addr,
                                                        uint16_t bits )
        {
            uint16_t s_val;

            _SDK_ATOMIC_LOCAL_OPS_2BYTE( addr, s_val, s_val ^= bits );
        }

        static inline void _SDK_AtomicLocalToggle4Byte( volatile uint32_t * addr,
                                                        uint32_t bits )
        {
            uint32_t s_val;

            _SDK_ATOMIC_LOCAL_OPS_4BYTE( addr, s_val, s_val ^= bits );
        }

        static inline void _SDK_AtomicLocalClearAndSet1Byte( volatile uint8_t * addr,
                                                             uint8_t clearBits,
                                                             uint8_t setBits )
        {
            uint8_t s_val;

            _SDK_ATOMIC_LOCAL_OPS_1BYTE( addr, s_val, s_val = ( s_val & ~clearBits ) | setBits );
        }

        static inline void _SDK_AtomicLocalClearAndSet2Byte( volatile uint16_t * addr,
                                                             uint16_t clearBits,
                                                             uint16_t setBits )
        {
            uint16_t s_val;

            _SDK_ATOMIC_LOCAL_OPS_2BYTE( addr, s_val, s_val = ( s_val & ~clearBits ) | setBits );
        }

        static inline void _SDK_AtomicLocalClearAndSet4Byte( volatile uint32_t * addr,
                                                             uint32_t clearBits,
                                                             uint32_t setBits )
        {
            uint32_t s_val;

            _SDK_ATOMIC_LOCAL_OPS_4BYTE( addr, s_val, s_val = ( s_val & ~clearBits ) | setBits );
        }

        #define SDK_ATOMIC_LOCAL_ADD( addr, val )                                                                                                 \
    ( ( 1UL == sizeof( *( addr ) ) ) ?                                                                                                            \
      _SDK_AtomicLocalAdd1Byte( ( volatile uint8_t * ) ( volatile void * ) ( addr ), ( uint8_t ) ( val ) ) :                                      \
      ( ( 2UL == sizeof( *( addr ) ) ) ? _SDK_AtomicLocalAdd2Byte( ( volatile uint16_t * ) ( volatile void * ) ( addr ), ( uint16_t ) ( val ) ) : \
        _SDK_AtomicLocalAdd4Byte( ( volatile uint32_t * ) ( volatile void * ) ( addr ), ( uint32_t ) ( val ) ) ) )

        #define SDK_ATOMIC_LOCAL_SET( addr, bits )                                                                                                 \
    ( ( 1UL == sizeof( *( addr ) ) ) ?                                                                                                             \
      _SDK_AtomicLocalSet1Byte( ( volatile uint8_t * ) ( volatile void * ) ( addr ), ( uint8_t ) ( bits ) ) :                                      \
      ( ( 2UL == sizeof( *( addr ) ) ) ? _SDK_AtomicLocalSet2Byte( ( volatile uint16_t * ) ( volatile void * ) ( addr ), ( uint16_t ) ( bits ) ) : \
        _SDK_AtomicLocalSet4Byte( ( volatile uint32_t * ) ( volatile void * ) ( addr ), ( uint32_t ) ( bits ) ) ) )

        #define SDK_ATOMIC_LOCAL_CLEAR( addr, bits )                                                                \
    ( ( 1UL == sizeof( *( addr ) ) ) ?                                                                              \
      _SDK_AtomicLocalClear1Byte( ( volatile uint8_t * ) ( volatile void * ) ( addr ), ( uint8_t ) ( bits ) ) :     \
      ( ( 2UL == sizeof( *( addr ) ) ) ?                                                                            \
        _SDK_AtomicLocalClear2Byte( ( volatile uint16_t * ) ( volatile void * ) ( addr ), ( uint16_t ) ( bits ) ) : \
        _SDK_AtomicLocalClear4Byte( ( volatile uint32_t * ) ( volatile void * ) ( addr ), ( uint32_t ) ( bits ) ) ) )

        #define SDK_ATOMIC_LOCAL_TOGGLE( addr, bits )                                                                \
    ( ( 1UL == sizeof( *( addr ) ) ) ?                                                                               \
      _SDK_AtomicLocalToggle1Byte( ( volatile uint8_t * ) ( volatile void * ) ( addr ), ( uint8_t ) ( bits ) ) :     \
      ( ( 2UL == sizeof( *( addr ) ) ) ?                                                                             \
        _SDK_AtomicLocalToggle2Byte( ( volatile uint16_t * ) ( volatile void * ) ( addr ), ( uint16_t ) ( bits ) ) : \
        _SDK_AtomicLocalToggle4Byte( ( volatile uint32_t * ) ( volatile void * ) ( addr ), ( uint32_t ) ( bits ) ) ) )

        #define SDK_ATOMIC_LOCAL_CLEAR_AND_SET( addr, clearBits, setBits )                                                                               \
    ( ( 1UL == sizeof( *( addr ) ) ) ?                                                                                                                   \
      _SDK_AtomicLocalClearAndSet1Byte( ( volatile uint8_t * ) ( volatile void * ) ( addr ), ( uint8_t ) ( clearBits ), ( uint8_t ) ( setBits ) ) :      \
      ( ( 2UL == sizeof( *( addr ) ) ) ?                                                                                                                 \
        _SDK_AtomicLocalClearAndSet2Byte( ( volatile uint16_t * ) ( volatile void * ) ( addr ), ( uint16_t ) ( clearBits ), ( uint16_t ) ( setBits ) ) : \
        _SDK_AtomicLocalClearAndSet4Byte( ( volatile uint32_t * ) ( volatile void * ) ( addr ), ( uint32_t ) ( clearBits ), ( uint32_t ) ( setBits ) ) ) )
    #else  /* if ( ( defined( __ARM_ARCH_7M__ ) && ( __ARM_ARCH_7M__ == 1 ) ) || ( defined( __ARM_ARCH_7EM__ ) && ( __ARM_ARCH_7EM__ == 1 ) ) || ( defined( __ARM_ARCH_8M_MAIN__ ) && ( __ARM_ARCH_8M_MAIN__ == 1 ) ) || ( defined( __ARM_ARCH_8M_BASE__ ) && ( __ARM_ARCH_8M_BASE__ == 1 ) ) ) */

        #define SDK_ATOMIC_LOCAL_ADD( addr, val ) \
    do                                            \
    {                                             \
        uint32_t s_atomicOldInt;                  \
        s_atomicOldInt = DisableGlobalIRQ();      \
        *( addr ) += ( val );                     \
        EnableGlobalIRQ( s_atomicOldInt );        \
    } while( 0 )

        #define SDK_ATOMIC_LOCAL_SET( addr, bits ) \
    do                                             \
    {                                              \
        uint32_t s_atomicOldInt;                   \
        s_atomicOldInt = DisableGlobalIRQ();       \
        *( addr ) |= ( bits );                     \
        EnableGlobalIRQ( s_atomicOldInt );         \
    } while( 0 )

