FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NXP_LPC55S69_MCUXpresso/NXP_Code/drivers/fsl_common_arm.h
        #define SDK_ATOMIC_LOCAL_CLEAR( addr, bits ) \
    do                                               \
    {                                                \
        uint32_t s_atomicOldInt;                     \
        s_atomicOldInt = DisableGlobalIRQ();         \
        *( addr ) &= ~( bits );                      \
        EnableGlobalIRQ( s_atomicOldInt );           \
    } while( 0 )

        #define SDK_ATOMIC_LOCAL_TOGGLE( addr, bits ) \
    do                                                \
    {                                                 \
        uint32_t s_atomicOldInt;                      \
        s_atomicOldInt = DisableGlobalIRQ();          \
        *( addr ) ^= ( bits );                        \
        EnableGlobalIRQ( s_atomicOldInt );            \
    } while( 0 )

        #define SDK_ATOMIC_LOCAL_CLEAR_AND_SET( addr, clearBits, setBits ) \
    do                                                                     \
    {                                                                      \
        uint32_t s_atomicOldInt;                                           \
        s_atomicOldInt = DisableGlobalIRQ();                               \
        *( addr ) = ( *( addr ) & ~( clearBits ) ) | ( setBits );          \
        EnableGlobalIRQ( s_atomicOldInt );                                 \
    } while( 0 )

    #endif /* if ( ( defined( __ARM_ARCH_7M__ ) && ( __ARM_ARCH_7M__ == 1 ) ) || ( defined( __ARM_ARCH_7EM__ ) && ( __ARM_ARCH_7EM__ == 1 ) ) || ( defined( __ARM_ARCH_8M_MAIN__ ) && ( __ARM_ARCH_8M_MAIN__ == 1 ) ) || ( defined( __ARM_ARCH_8M_BASE__ ) && ( __ARM_ARCH_8M_BASE__ == 1 ) ) ) */
/* @} */

/*! @name Timer utilities */
/* @{ */
/*! Macro to convert a microsecond period to raw count value */
    #define USEC_TO_COUNT( us, clockFreqInHz )       ( uint64_t ) ( ( ( uint64_t ) ( us ) * ( clockFreqInHz ) ) / 1000000U )
/*! Macro to convert a raw count value to microsecond */
    #define COUNT_TO_USEC( count, clockFreqInHz )    ( uint64_t ) ( ( uint64_t ) ( count ) * 1000000U / ( clockFreqInHz ) )

/*! Macro to convert a millisecond period to raw count value */
    #define MSEC_TO_COUNT( ms, clockFreqInHz )       ( uint64_t ) ( ( uint64_t ) ( ms ) * ( clockFreqInHz ) / 1000U )
/*! Macro to convert a raw count value to millisecond */
    #define COUNT_TO_MSEC( count, clockFreqInHz )    ( uint64_t ) ( ( uint64_t ) ( count ) * 1000U / ( clockFreqInHz ) )
/* @} */

/*! @name ISR exit barrier
 * @{
 *
 * ARM errata 838869, affects Cortex-M4, Cortex-M4F Store immediate overlapping
 * exception return operation might vector to incorrect interrupt.
 * For Cortex-M7, if core speed much faster than peripheral register write speed,
 * the peripheral interrupt flags may be still set after exiting ISR, this results to
 * the same error similar with errata 83869.
 */
    #if ( defined __CORTEX_M ) && ( ( __CORTEX_M == 4U ) || ( __CORTEX_M == 7U ) )
        #define SDK_ISR_EXIT_BARRIER    __DSB()
    #else
        #define SDK_ISR_EXIT_BARRIER
    #endif

/* @} */

/*! @name Alignment variable definition macros */
/* @{ */
    #if ( defined( __ICCARM__ ) )

/*
 * Workaround to disable MISRA C message suppress warnings for IAR compiler.
 * http:/ /supp.iar.com/Support/?note=24725
 */
        _Pragma("diag_suppress=Pm120")
        #define SDK_PRAGMA( x )                 _Pragma(#x)
        _Pragma("diag_error=Pm120")
/*! Macro to define a variable with alignbytes alignment */
        #define SDK_ALIGN( var, alignbytes )    SDK_PRAGMA( data_alignment = alignbytes ) var
    #elif defined( __CC_ARM ) || defined( __ARMCC_VERSION )
/*! Macro to define a variable with alignbytes alignment */
        #define SDK_ALIGN( var, alignbytes )    __attribute__( ( aligned( alignbytes ) ) ) var
    #elif defined( __GNUC__ )
/*! Macro to define a variable with alignbytes alignment */
        #define SDK_ALIGN( var, alignbytes )    var __attribute__( ( aligned( alignbytes ) ) )
    #else  /* if ( defined( __ICCARM__ ) ) */
        #error Toolchain not supported
    #endif /* if ( defined( __ICCARM__ ) ) */

/*! Macro to define a variable with L1 d-cache line size alignment */
    #if defined( FSL_FEATURE_L1DCACHE_LINESIZE_BYTE )
        #define SDK_L1DCACHE_ALIGN( var )    SDK_ALIGN( var, FSL_FEATURE_L1DCACHE_LINESIZE_BYTE )
    #endif
/*! Macro to define a variable with L2 cache line size alignment */
    #if defined( FSL_FEATURE_L2CACHE_LINESIZE_BYTE )
        #define SDK_L2CACHE_ALIGN( var )    SDK_ALIGN( var, FSL_FEATURE_L2CACHE_LINESIZE_BYTE )
    #endif

/*! Macro to change a value to a given size aligned value */
    #define SDK_SIZEALIGN( var, alignbytes ) \
    ( ( unsigned int ) ( ( var ) + ( ( alignbytes ) - 1U ) ) & ( unsigned int ) ( ~( unsigned int ) ( ( alignbytes ) - 1U ) ) )
/* @} */

/*! @name Non-cacheable region definition macros */

/* For initialized non-zero non-cacheable variables, please using "AT_NONCACHEABLE_SECTION_INIT(var) ={xx};" or
 * "AT_NONCACHEABLE_SECTION_ALIGN_INIT(var) ={xx};" in your projects to define them, for zero-inited non-cacheable
 * variables, please using "AT_NONCACHEABLE_SECTION(var);" or "AT_NONCACHEABLE_SECTION_ALIGN(var);" to define them,
 * these zero-inited variables will be initialized to zero in system startup.
 */
/* @{ */

    #if ( ( !( defined( FSL_FEATURE_HAS_NO_NONCACHEABLE_SECTION ) && FSL_FEATURE_HAS_NO_NONCACHEABLE_SECTION ) ) && \
    defined( FSL_FEATURE_L1ICACHE_LINESIZE_BYTE ) )

        #if ( defined( __ICCARM__ ) )
            #define AT_NONCACHEABLE_SECTION( var )                      var @"NonCacheable"
            #define AT_NONCACHEABLE_SECTION_ALIGN( var, alignbytes )    SDK_PRAGMA( data_alignment = alignbytes ) var @"NonCacheable"
            #define AT_NONCACHEABLE_SECTION_INIT( var )                 var @"NonCacheable.init"
            #define AT_NONCACHEABLE_SECTION_ALIGN_INIT( var, alignbytes ) \
    SDK_PRAGMA( data_alignment = alignbytes ) var @"NonCacheable.init"

        #elif ( defined( __CC_ARM ) || defined( __ARMCC_VERSION ) )
            #define AT_NONCACHEABLE_SECTION_INIT( var )    __attribute__( ( section( "NonCacheable.init" ) ) ) var
            #define AT_NONCACHEABLE_SECTION_ALIGN_INIT( var, alignbytes ) \
    __attribute__( ( section( "NonCacheable.init" ) ) ) __attribute__( ( aligned( alignbytes ) ) ) var
            #if ( defined( __CC_ARM ) )
                #define AT_NONCACHEABLE_SECTION( var )     __attribute__( ( section( "NonCacheable" ), zero_init ) ) var
                #define AT_NONCACHEABLE_SECTION_ALIGN( var, alignbytes ) \
    __attribute__( ( section( "NonCacheable" ), zero_init ) ) __attribute__( ( aligned( alignbytes ) ) ) var
            #else
                #define AT_NONCACHEABLE_SECTION( var )     __attribute__( ( section( ".bss.NonCacheable" ) ) ) var
                #define AT_NONCACHEABLE_SECTION_ALIGN( var, alignbytes ) \
    __attribute__( ( section( ".bss.NonCacheable" ) ) ) __attribute__( ( aligned( alignbytes ) ) ) var
            #endif

        #elif ( defined( __GNUC__ ) )

/* For GCC, when the non-cacheable section is required, please define "__STARTUP_INITIALIZE_NONCACHEDATA"
 * in your projects to make sure the non-cacheable section variables will be initialized in system startup.
 */
            #define AT_NONCACHEABLE_SECTION_INIT( var )    __attribute__( ( section( "NonCacheable.init" ) ) ) var
            #define AT_NONCACHEABLE_SECTION_ALIGN_INIT( var, alignbytes ) \
    __attribute__( ( section( "NonCacheable.init" ) ) ) var __attribute__( ( aligned( alignbytes ) ) )
            #define AT_NONCACHEABLE_SECTION( var )         __attribute__( ( section( "NonCacheable,\"aw\",%nobits @" ) ) ) var
            #define AT_NONCACHEABLE_SECTION_ALIGN( var, alignbytes ) \
    __attribute__( ( section( "NonCacheable,\"aw\",%nobits @" ) ) ) var __attribute__( ( aligned( alignbytes ) ) )
        #else  /* if ( defined( __ICCARM__ ) ) */
            #error Toolchain not supported.
        #endif /* if ( defined( __ICCARM__ ) ) */

