FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NXP_LPC55S69_MCUXpresso/NXP_Code/drivers/fsl_common_arm.h
    #else  /* if ( ( !( defined( FSL_FEATURE_HAS_NO_NONCACHEABLE_SECTION ) && FSL_FEATURE_HAS_NO_NONCACHEABLE_SECTION ) ) && defined( FSL_FEATURE_L1ICACHE_LINESIZE_BYTE ) ) */

        #define AT_NONCACHEABLE_SECTION( var )                           var
        #define AT_NONCACHEABLE_SECTION_ALIGN( var, alignbytes )         SDK_ALIGN( var, alignbytes )
        #define AT_NONCACHEABLE_SECTION_INIT( var )                      var
        #define AT_NONCACHEABLE_SECTION_ALIGN_INIT( var, alignbytes )    SDK_ALIGN( var, alignbytes )

    #endif /* if ( ( !( defined( FSL_FEATURE_HAS_NO_NONCACHEABLE_SECTION ) && FSL_FEATURE_HAS_NO_NONCACHEABLE_SECTION ) ) && defined( FSL_FEATURE_L1ICACHE_LINESIZE_BYTE ) ) */

/* @} */

/*!
 * @name Time sensitive region
 * @{
 */
    #if ( defined( __ICCARM__ ) )
        #define AT_QUICKACCESS_SECTION_CODE( func )    func @"CodeQuickAccess"
        #define AT_QUICKACCESS_SECTION_DATA( var )     var @"DataQuickAccess"
        #define AT_QUICKACCESS_SECTION_DATA_ALIGN( var, alignbytes ) \
    SDK_PRAGMA( data_alignment = alignbytes ) var @"DataQuickAccess"
    #elif ( defined( __CC_ARM ) || defined( __ARMCC_VERSION ) )
        #define AT_QUICKACCESS_SECTION_CODE( func )    __attribute__( ( section( "CodeQuickAccess" ), __noinline__ ) ) func
        #define AT_QUICKACCESS_SECTION_DATA( var )     __attribute__( ( section( "DataQuickAccess" ) ) ) var
        #define AT_QUICKACCESS_SECTION_DATA_ALIGN( var, alignbytes ) \
    __attribute__( ( section( "DataQuickAccess" ) ) ) __attribute__( ( aligned( alignbytes ) ) ) var
    #elif ( defined( __GNUC__ ) )
        #define AT_QUICKACCESS_SECTION_CODE( func )    __attribute__( ( section( "CodeQuickAccess" ), __noinline__ ) ) func
        #define AT_QUICKACCESS_SECTION_DATA( var )     __attribute__( ( section( "DataQuickAccess" ) ) ) var
        #define AT_QUICKACCESS_SECTION_DATA_ALIGN( var, alignbytes ) \
    __attribute__( ( section( "DataQuickAccess" ) ) ) var __attribute__( ( aligned( alignbytes ) ) )
    #else  /* if ( defined( __ICCARM__ ) ) */
        #error Toolchain not supported.
    #endif /* defined(__ICCARM__) */

/*! @name Ram Function */
    #if ( defined( __ICCARM__ ) )
        #define RAMFUNCTION_SECTION_CODE( func )    func @"RamFunction"
    #elif ( defined( __CC_ARM ) || defined( __ARMCC_VERSION ) )
        #define RAMFUNCTION_SECTION_CODE( func )    __attribute__( ( section( "RamFunction" ) ) ) func
    #elif ( defined( __GNUC__ ) )
        #define RAMFUNCTION_SECTION_CODE( func )    __attribute__( ( section( "RamFunction" ) ) ) func
    #else
        #error Toolchain not supported.
    #endif /* defined(__ICCARM__) */
/* @} */

    #if defined( __ARMCC_VERSION ) && ( __ARMCC_VERSION >= 6010050 )
        void DefaultISR( void );
    #endif

/*
 * The fsl_clock.h is included here because it needs MAKE_VERSION/MAKE_STATUS/status_t
 * defined in previous of this file.
 */
    #include "fsl_clock.h"

/*
 * Chip level peripheral reset API, for MCUs that implement peripheral reset control external to a peripheral
 */
    #if ( ( defined( FSL_FEATURE_SOC_SYSCON_COUNT ) && ( FSL_FEATURE_SOC_SYSCON_COUNT > 0 ) ) || \
    ( defined( FSL_FEATURE_SOC_ASYNC_SYSCON_COUNT ) && ( FSL_FEATURE_SOC_ASYNC_SYSCON_COUNT > 0 ) ) )
        #include "fsl_reset.h"
    #endif

/*******************************************************************************
 * API
 ******************************************************************************/

    #if defined( __cplusplus )
    extern "C" {
    #endif /* __cplusplus*/

/*!
 * @brief Enable specific interrupt.
 *
 * Enable LEVEL1 interrupt. For some devices, there might be multiple interrupt
 * levels. For example, there are NVIC and intmux. Here the interrupts connected
 * to NVIC are the LEVEL1 interrupts, because they are routed to the core directly.
 * The interrupts connected to intmux are the LEVEL2 interrupts, they are routed
 * to NVIC first then routed to core.
 *
 * This function only enables the LEVEL1 interrupts. The number of LEVEL1 interrupts
 * is indicated by the feature macro FSL_FEATURE_NUMBER_OF_LEVEL1_INT_VECTORS.
 *
 * @param interrupt The IRQ number.
 * @retval kStatus_Success Interrupt enabled successfully
 * @retval kStatus_Fail Failed to enable the interrupt
 */
    static inline status_t EnableIRQ( IRQn_Type interrupt )
    {
        status_t status = kStatus_Success;

        if( NotAvail_IRQn == interrupt )
        {
            status = kStatus_Fail;
        }

        #if defined( FSL_FEATURE_NUMBER_OF_LEVEL1_INT_VECTORS ) && ( FSL_FEATURE_NUMBER_OF_LEVEL1_INT_VECTORS > 0 )
            else if( ( int32_t ) interrupt >= ( int32_t ) FSL_FEATURE_NUMBER_OF_LEVEL1_INT_VECTORS )
            {
                status = kStatus_Fail;
            }
        #endif

        else
        {
            #if defined( __GIC_PRIO_BITS )
                GIC_EnableIRQ( interrupt );
            #else
                NVIC_EnableIRQ( interrupt );
            #endif
        }

        return status;
    }

/*!
 * @brief Disable specific interrupt.
 *
 * Disable LEVEL1 interrupt. For some devices, there might be multiple interrupt
 * levels. For example, there are NVIC and intmux. Here the interrupts connected
 * to NVIC are the LEVEL1 interrupts, because they are routed to the core directly.
 * The interrupts connected to intmux are the LEVEL2 interrupts, they are routed
 * to NVIC first then routed to core.
 *
 * This function only disables the LEVEL1 interrupts. The number of LEVEL1 interrupts
 * is indicated by the feature macro FSL_FEATURE_NUMBER_OF_LEVEL1_INT_VECTORS.
 *
 * @param interrupt The IRQ number.
 * @retval kStatus_Success Interrupt disabled successfully
 * @retval kStatus_Fail Failed to disable the interrupt
 */
    static inline status_t DisableIRQ( IRQn_Type interrupt )
    {
        status_t status = kStatus_Success;

        if( NotAvail_IRQn == interrupt )
        {
            status = kStatus_Fail;
        }

        #if defined( FSL_FEATURE_NUMBER_OF_LEVEL1_INT_VECTORS ) && ( FSL_FEATURE_NUMBER_OF_LEVEL1_INT_VECTORS > 0 )
            else if( ( int32_t ) interrupt >= ( int32_t ) FSL_FEATURE_NUMBER_OF_LEVEL1_INT_VECTORS )
            {
                status = kStatus_Fail;
            }
        #endif

        else
        {
            #if defined( __GIC_PRIO_BITS )
                GIC_DisableIRQ( interrupt );
            #else
                NVIC_DisableIRQ( interrupt );
            #endif
        }

