FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NXP_LPC55S69_MCUXpresso/NXP_Code/drivers/fsl_common_arm.h
        return status;
    }

/*!
 * @brief Enable the IRQ, and also set the interrupt priority.
 *
 * Only handle LEVEL1 interrupt. For some devices, there might be multiple interrupt
 * levels. For example, there are NVIC and intmux. Here the interrupts connected
 * to NVIC are the LEVEL1 interrupts, because they are routed to the core directly.
 * The interrupts connected to intmux are the LEVEL2 interrupts, they are routed
 * to NVIC first then routed to core.
 *
 * This function only handles the LEVEL1 interrupts. The number of LEVEL1 interrupts
 * is indicated by the feature macro FSL_FEATURE_NUMBER_OF_LEVEL1_INT_VECTORS.
 *
 * @param interrupt The IRQ to Enable.
 * @param priNum Priority number set to interrupt controller register.
 * @retval kStatus_Success Interrupt priority set successfully
 * @retval kStatus_Fail Failed to set the interrupt priority.
 */
    static inline status_t EnableIRQWithPriority( IRQn_Type interrupt,
                                                  uint8_t priNum )
    {
        status_t status = kStatus_Success;

        if( NotAvail_IRQn == interrupt )
        {
            status = kStatus_Fail;
        }

        #if defined( FSL_FEATURE_NUMBER_OF_LEVEL1_INT_VECTORS ) && ( FSL_FEATURE_NUMBER_OF_LEVEL1_INT_VECTORS > 0 )
            else if( ( int32_t ) interrupt >= ( int32_t ) FSL_FEATURE_NUMBER_OF_LEVEL1_INT_VECTORS )
            {
                status = kStatus_Fail;
            }
        #endif

        else
        {
            #if defined( __GIC_PRIO_BITS )
                GIC_SetPriority( interrupt, priNum );
                GIC_EnableIRQ( interrupt );
            #else
                NVIC_SetPriority( interrupt, priNum );
                NVIC_EnableIRQ( interrupt );
            #endif
        }

        return status;
    }

/*!
 * @brief Set the IRQ priority.
 *
 * Only handle LEVEL1 interrupt. For some devices, there might be multiple interrupt
 * levels. For example, there are NVIC and intmux. Here the interrupts connected
 * to NVIC are the LEVEL1 interrupts, because they are routed to the core directly.
 * The interrupts connected to intmux are the LEVEL2 interrupts, they are routed
 * to NVIC first then routed to core.
 *
 * This function only handles the LEVEL1 interrupts. The number of LEVEL1 interrupts
 * is indicated by the feature macro FSL_FEATURE_NUMBER_OF_LEVEL1_INT_VECTORS.
 *
 * @param interrupt The IRQ to set.
 * @param priNum Priority number set to interrupt controller register.
 *
 * @retval kStatus_Success Interrupt priority set successfully
 * @retval kStatus_Fail Failed to set the interrupt priority.
 */
    static inline status_t IRQ_SetPriority( IRQn_Type interrupt,
                                            uint8_t priNum )
    {
        status_t status = kStatus_Success;

        if( NotAvail_IRQn == interrupt )
        {
            status = kStatus_Fail;
        }

        #if defined( FSL_FEATURE_NUMBER_OF_LEVEL1_INT_VECTORS ) && ( FSL_FEATURE_NUMBER_OF_LEVEL1_INT_VECTORS > 0 )
            else if( ( int32_t ) interrupt >= ( int32_t ) FSL_FEATURE_NUMBER_OF_LEVEL1_INT_VECTORS )
            {
                status = kStatus_Fail;
            }
        #endif

        else
        {
            #if defined( __GIC_PRIO_BITS )
                GIC_SetPriority( interrupt, priNum );
            #else
                NVIC_SetPriority( interrupt, priNum );
            #endif
        }

        return status;
    }

/*!
 * @brief Clear the pending IRQ flag.
 *
 * Only handle LEVEL1 interrupt. For some devices, there might be multiple interrupt
 * levels. For example, there are NVIC and intmux. Here the interrupts connected
 * to NVIC are the LEVEL1 interrupts, because they are routed to the core directly.
 * The interrupts connected to intmux are the LEVEL2 interrupts, they are routed
 * to NVIC first then routed to core.
 *
 * This function only handles the LEVEL1 interrupts. The number of LEVEL1 interrupts
 * is indicated by the feature macro FSL_FEATURE_NUMBER_OF_LEVEL1_INT_VECTORS.
 *
 * @param interrupt The flag which IRQ to clear.
 *
 * @retval kStatus_Success Interrupt priority set successfully
 * @retval kStatus_Fail Failed to set the interrupt priority.
 */
    static inline status_t IRQ_ClearPendingIRQ( IRQn_Type interrupt )
    {
        status_t status = kStatus_Success;

        if( NotAvail_IRQn == interrupt )
        {
            status = kStatus_Fail;
        }

        #if defined( FSL_FEATURE_NUMBER_OF_LEVEL1_INT_VECTORS ) && ( FSL_FEATURE_NUMBER_OF_LEVEL1_INT_VECTORS > 0 )
            else if( ( int32_t ) interrupt >= ( int32_t ) FSL_FEATURE_NUMBER_OF_LEVEL1_INT_VECTORS )
            {
                status = kStatus_Fail;
            }
        #endif

        else
        {
            #if defined( __GIC_PRIO_BITS )
                GIC_ClearPendingIRQ( interrupt );
            #else
                NVIC_ClearPendingIRQ( interrupt );
            #endif
        }

        return status;
    }

/*!
 * @brief Disable the global IRQ
 *
 * Disable the global interrupt and return the current primask register. User is required to provided the primask
 * register for the EnableGlobalIRQ().
 *
 * @return Current primask value.
 */
    static inline uint32_t DisableGlobalIRQ( void )
    {
        uint32_t mask;

        #if defined( CPSR_I_Msk )
            mask = __get_CPSR() & CPSR_I_Msk;
        #elif defined( DAIF_I_BIT )
            mask = __get_DAIF() & DAIF_I_BIT;
        #else
            mask = __get_PRIMASK();
        #endif
        __disable_irq();

        return mask;
    }

/*!
 * @brief Enable the global IRQ
 *
 * Set the primask register with the provided primask value but not just enable the primask. The idea is for the
 * convenience of integration of RTOS. some RTOS get its own management mechanism of primask. User is required to
 * use the EnableGlobalIRQ() and DisableGlobalIRQ() in pair.
 *
 * @param primask value of primask register to be restored. The primask value is supposed to be provided by the
 * DisableGlobalIRQ().
 */
    static inline void EnableGlobalIRQ( uint32_t primask )
    {
        #if defined( CPSR_I_Msk )
            __set_CPSR( ( __get_CPSR() & ~CPSR_I_Msk ) | primask );
        #elif defined( DAIF_I_BIT )
            if( 0UL == primask )
            {
                __enable_irq();
            }
        #else
            __set_PRIMASK( primask );
        #endif
    }

    #if defined( ENABLE_RAM_VECTOR_TABLE )

/*!
 * @brief install IRQ handler
 *
 * @param irq IRQ number
 * @param irqHandler IRQ handler address
 * @return The old IRQ handler address
 */
        uint32_t InstallIRQHandler( IRQn_Type irq,
                                    uint32_t irqHandler );
    #endif /* ENABLE_RAM_VECTOR_TABLE. */

    #if ( defined( FSL_FEATURE_SOC_SYSCON_COUNT ) && ( FSL_FEATURE_SOC_SYSCON_COUNT > 0 ) )

