FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NXP_LPC55S69_MCUXpresso/NXP_Code/drivers/fsl_common_arm.h
/*
 * When FSL_FEATURE_POWERLIB_EXTEND is defined to non-zero value,
 * powerlib should be used instead of these functions.
 */
        #if !( defined( FSL_FEATURE_POWERLIB_EXTEND ) && ( FSL_FEATURE_POWERLIB_EXTEND != 0 ) )

/*!
 * @brief Enable specific interrupt for wake-up from deep-sleep mode.
 *
 * Enable the interrupt for wake-up from deep sleep mode.
 * Some interrupts are typically used in sleep mode only and will not occur during
 * deep-sleep mode because relevant clocks are stopped. However, it is possible to enable
 * those clocks (significantly increasing power consumption in the reduced power mode),
 * making these wake-ups possible.
 *
 * @note This function also enables the interrupt in the NVIC (EnableIRQ() is called internaly).
 *
 * @param interrupt The IRQ number.
 */
            void EnableDeepSleepIRQ( IRQn_Type interrupt );

/*!
 * @brief Disable specific interrupt for wake-up from deep-sleep mode.
 *
 * Disable the interrupt for wake-up from deep sleep mode.
 * Some interrupts are typically used in sleep mode only and will not occur during
 * deep-sleep mode because relevant clocks are stopped. However, it is possible to enable
 * those clocks (significantly increasing power consumption in the reduced power mode),
 * making these wake-ups possible.
 *
 * @note This function also disables the interrupt in the NVIC (DisableIRQ() is called internaly).
 *
 * @param interrupt The IRQ number.
 */
            void DisableDeepSleepIRQ( IRQn_Type interrupt );
        #endif /* FSL_FEATURE_POWERLIB_EXTEND */
    #endif /* FSL_FEATURE_SOC_SYSCON_COUNT */

    #if defined( DWT )

/*!
 * @brief Enable the counter to get CPU cycles.
 */
        void MSDK_EnableCpuCycleCounter( void );

/*!
 * @brief Get the current CPU cycle count.
 *
 * @return Current CPU cycle count.
 */
        uint32_t MSDK_GetCpuCycleCount( void );
    #endif

    #if defined( __cplusplus )
    }
    #endif /* __cplusplus*/

/*! @} */

#endif /* _FSL_COMMON_ARM_H_ */
